app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 26 Jul 2012 15:51:13 BRT -03:00], ["updated_at", Thu, 26 Jul 2012 15:51:13 BRT -03:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "carts" SET "created_at" = '2012-07-26 18:51:13.000000', "updated_at" = '2012-07-26 18:51:13.000000' WHERE "carts"."id" = 980190962
---
  def update
    @cart = Cart.find(params[:id])

    respond_to do |format|
      if @cart.update_attributes(params[:cart])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]
---
  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy