app/controllers/line_items_controller.rb

  def show
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    session[:counter]= 0 if session[:counter]
    #debugger
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id,product.price)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "6"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 27 Jul 2012 10:50:20 BRT -03:00], ["updated_at", Fri, 27 Jul 2012 10:50:20 BRT -03:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "price", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 13], ["created_at", Mon, 30 Jul 2012 14:40:43 BRT -03:00], ["price", nil], ["product_id", 6], ["quantity", 1], ["updated_at", Mon, 30 Jul 2012 14:40:43 BRT -03:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-07-27 18:13:59.536763' WHERE "line_items"."id" = 14

  def update
    @line_item = LineItem.find(params[:id])

    respond_to do |format|
      if @line_item.update_attributes(params[:line_item])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "line_items" SET "created_at" = '2012-07-26 18:51:13.000000', "updated_at" = '2012-07-26 18:51:13.000000' WHERE "line_items"."id" = 980190962

  def destroy
    @line_item = LineItem.find(params[:id])
    @line_item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 1]]