app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
    @count = counter_index
    @products = Product.all